app/controllers/books_controller.rb

    def available
        books = Book.where(checked_out: false)
        render json: books.map { |book| { title: book.title, author: book.author } }
---
SELECT "books".* FROM "books" WHERE "books"."checked_out" = ?  [["checked_out", 0]]