app/models/book.rb

SELECT title, count(*) as count FROM "books" GROUP BY "books"."title" HAVING (count(*) > 1)
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 4]]
SELECT "books".* FROM "books" WHERE "books"."title" = ? LIMIT -1 OFFSET ?  [["title", "The Great Gatsby"], ["OFFSET", 1]]
---
class Book < ApplicationRecord

    duplicate_books = Book.select("title, count(*) as count").group(:title).having("count(*) > 1")

# Loop through each duplicate title and delete all but the first record
duplicate_books.each do |book|
  Book.where(title: book.title).offset(1).destroy_all